#Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.
#Например:
#4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
#2 -> " -2, -1, 0, 1, 2"

a = int(input("введите первое число: "))
n = -1 * a
lain = "ответ:"
while n <= a:
    #print(n)
    lain = lain + str(n)+" "
    n = n + 1 
print(lain)